app/Controllers/AdminDashboard.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `courses`
---
    private function getAdminStats()
    {
        // Use UserModel for better statistics
        $stats = $this->userModel->getUserStats();

        // Add recent users
        $stats['recent_users'] = $this->userModel->getRecentUsers(5);

        // Pending users count
        $stats['pending_users'] = $this->userModel->where('status', 'pending')->countAllResults();

        // Total courses (if table exists)
        if ($this->db->tableExists('courses')) {
            $builder = $this->db->table('courses');
            $stats['total_courses'] = $builder->countAllResults();