app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'student@lms.com'
---

                // Check if user exists
                $builder = $this->db->table('users');
                $user = $builder->where('email', $email)->get()->getRowArray();