app/Controllers/Course.php

SELECT *
FROM `courses`
WHERE `courses`.`id` = '8'
---
        }

        // Check if course exists
        $course = $this->courseModel->find($courseId);