app/Controllers/StudentDashboard.php

SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `user_id` = '25'
---
    private function getStudentStats()
    {
        $stats = [
            'enrolled_courses' => 0,
            'completed_assignments' => 0,
            'pending_assignments' => 0,
            'average_grade' => 0
        ];

        try {
            $studentId = $this->session->get('user_id');

            // Check column names in enrollments table
            $enrollmentUserColumn = null;
            if ($this->db->tableExists('enrollments')) {
                $fields = $this->db->getFieldNames('enrollments');
                if (in_array('student_id', $fields)) {
                    $enrollmentUserColumn = 'student_id';
                } elseif (in_array('user_id', $fields)) {
                    $enrollmentUserColumn = 'user_id';
                }
            }

            // Enrolled courses
            if ($this->db->tableExists('enrollments')) {
                $builder = $this->db->table('enrollments');
                if ($enrollmentUserColumn) {
                    $stats['enrolled_courses'] = $builder->where($enrollmentUserColumn, $studentId)->countAllResults();