app/Models/CourseModel.php

SELECT `c`.*, `u`.`name` as `teacher_name`
FROM `courses` `c`
LEFT JOIN `users` `u` ON `u`.`id` = `c`.`teacher_id`
WHERE `c`.`status` = 'active'
AND c.id NOT IN (
                                  SELECT COALESCE(course_id, 0) FROM enrollments 
                                  WHERE user_id = 25
                              )
ORDER BY `c`.`course_name` ASC
---
    public function getAvailableCoursesForUser($userId)
    {
        try {
            $builder = $this->db->table('courses c');

            // Check if enrollments table exists
            if (!$this->db->tableExists('enrollments')) {
                // If no enrollments table, return all active courses
                return $builder->select('c.*, u.name as teacher_name')
                              ->join('users u', 'u.id = c.teacher_id', 'left')
                              ->where('c.status', 'active')
                              ->orderBy('c.course_name', 'ASC')
                              ->get()
                              ->getResultArray();
            }

            // Get courses where user is not enrolled
            $courses = $builder->select('c.*, u.name as teacher_name')
                              ->join('users u', 'u.id = c.teacher_id', 'left')
                              ->where('c.status', 'active')
                              ->where("c.id NOT IN (
                                  SELECT COALESCE(course_id, 0) FROM enrollments
                                  WHERE user_id = {$userId}
                              )")
                              ->orderBy('c.course_name', 'ASC')
                              ->get()
                              ->getResultArray();

SELECT *
FROM `courses`
WHERE `courses`.`id` = '8'
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `course_id` = '8'
AND `status` = 'active'
---
    public function hasAvailableSlots($courseId)
    {
        // Get course max students
        $course = $this->find($courseId);
        if (!$course) {
            return false;
        }

        // Count current enrollments
        $builder = $this->db->table('enrollments');
        $currentEnrollments = $builder->where('course_id', $courseId)
                                    ->where('status', 'active')
                                    ->countAllResults();