app/Models/EnrollmentModel.php

    public function enrollUser($data)
    {
        // Check if already enrolled
        if ($this->isAlreadyEnrolled($data['user_id'], $data['course_id'])) {
            return false;
        }

        // Set enrollment date if not provided
        if (!isset($data['enrollment_date'])) {
            $data['enrollment_date'] = date('Y-m-d H:i:s');
        }

        // Set default status
        if (!isset($data['status'])) {
            $data['status'] = 'active';
        }

        return $this->insert($data);
---
INSERT INTO `enrollments` (`user_id`, `course_id`, `enrollment_date`, `status`, `created_at`, `updated_at`) VALUES ('25', '8', '2025-10-11 05:21:18', 'active', '2025-10-11 05:21:18', '2025-10-11 05:21:18')

    public function isAlreadyEnrolled($userId, $courseId)
    {
        $enrollment = $this->where('user_id', $userId)
                          ->where('course_id', $courseId)
                          ->where('status', 'active')
                          ->first();
---
SELECT *
FROM `enrollments`
WHERE `user_id` = '25'
AND `course_id` = '8'
AND `status` = 'active'
 LIMIT 1

    public function getUserEnrollments($userId)
    {
        try {
            // Check if required tables exist
            if (!$this->db->tableExists('courses')) {
                return [];
            }

            $builder = $this->db->table('enrollments e');

            return $builder->select('e.*, c.course_code, c.course_name, c.description, c.credits, u.name as teacher_name')
                          ->join('courses c', 'c.id = e.course_id')
                          ->join('users u', 'u.id = c.teacher_id', 'left')
                          ->where('e.user_id', $userId)
                          ->where('e.status', 'active')
                          ->orderBy('e.enrollment_date', 'DESC')
                          ->get()
                          ->getResultArray();
---
SELECT `e`.*, `c`.`course_code`, `c`.`course_name`, `c`.`description`, `c`.`credits`, `u`.`name` as `teacher_name`
FROM `enrollments` `e`
JOIN `courses` `c` ON `c`.`id` = `e`.`course_id`
LEFT JOIN `users` `u` ON `u`.`id` = `c`.`teacher_id`
WHERE `e`.`user_id` = '25'
AND `e`.`status` = 'active'
ORDER BY `e`.`enrollment_date` DESC

    public function getUserEnrollmentStats($userId)
    {
        $stats = [];

        // Total enrolled courses
        $stats['total_enrolled'] = $this->where('user_id', $userId)
                                       ->where('status', 'active')
                                       ->countAllResults();

        // Completed courses
        $stats['completed_courses'] = $this->where('user_id', $userId)
                                          ->where('status', 'completed')
                                          ->countAllResults();

        // Dropped courses
        $stats['dropped_courses'] = $this->where('user_id', $userId)
                                        ->where('status', 'dropped')
                                        ->countAllResults();

        // Recent enrollments (last 30 days)
        $stats['recent_enrollments'] = $this->where('user_id', $userId)
                                           ->where('enrollment_date >=', date('Y-m-d H:i:s', strtotime('-30 days')))
                                           ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `user_id` = '25'
AND `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `user_id` = '25'
AND `status` = 'completed'
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `user_id` = '25'
AND `status` = 'dropped'
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `user_id` = '25'
AND `enrollment_date` >= '2025-09-11 05:45:23'