app/Models/UserModel.php

    public function verifyPassword($email, $password)
    {
        $user = $this->where('email', $email)->first();

        if ($user && password_verify($password, $user['password'])) {
            // Update last login
            $this->update($user['id'], [
                'last_login' => date('Y-m-d H:i:s'),
                'last_login_ip' => $_SERVER['REMOTE_ADDR'] ?? '127.0.0.1'
            ]);
---
SELECT *
FROM `users`
WHERE `email` = 'krish31@student.com'
 LIMIT 1
UPDATE `users` SET `last_login` = '2025-10-11 05:21:07', `last_login_ip` = '::1', `updated_at` = '2025-10-11 05:21:07'
WHERE `users`.`id` IN ('25')

    public function getUserStats()
    {
        $stats = [];

        // Total users
        $stats['total_users'] = $this->countAllResults();

        // Users by role
        $stats['admin_count'] = $this->where('role', 'admin')->countAllResults();
        $stats['teacher_count'] = $this->where('role', 'teacher')->countAllResults();
        $stats['student_count'] = $this->where('role', 'student')->countAllResults();

        // Recent registrations (last 7 days)
        $stats['recent_registrations'] = $this->where('created_at >=', date('Y-m-d H:i:s', strtotime('-7 days')))->countAllResults();

        // Today's registrations
        $stats['today_registrations'] = $this->where('DATE(created_at)', date('Y-m-d'))->countAllResults();

        // Active users (logged in within last 30 days)
        $stats['active_users'] = $this->where('last_login >=', date('Y-m-d H:i:s', strtotime('-30 days')))->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'admin'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'teacher'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'student'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `created_at` >= '2025-10-04 04:32:48'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE DATE(created_at) = '2025-10-11'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `last_login` >= '2025-09-11 04:32:48'

    public function getRecentUsers($limit = 10)
    {
        return $this->select('id, name, email, role, created_at')
                   ->orderBy('created_at', 'DESC')
                   ->limit($limit)
                   ->findAll();
---
SELECT `id`, `name`, `email`, `role`, `created_at`
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 5